/* 
  KPKLocalizable.strings
  MacPass

  Created by Michael Starke on 20/12/13.
  Copyright (c) 2013 HicknHack Software GmbH. All rights reserved.
*/

"SET_TITLE" = "Изменить Заголовок";
"SET_USERNAME" = "Изменить Имя пользователя";
"SET_PASSWORD" = "Изменить Пароль";
"SET_URL" = "Изменить URL";
"SET_NOTES" = "Изменить Заметки";

"DATABASE" = "База данных";
"EMAIL" = "EMail";
"GENERAL" = "Общие";
"HOMEBANKING" = "Домашний банк";
"INTERNET" = "Интернет";
"NETWORK" = "Сеть";
"TRASH" = "Удалить";
"WINDOWS" = "Windows";

/* Copy */
"KPK_GROUP_COPY_%@" = "%@ копия";
"KPK_ENTRY_COPY_%@" = "%@ копия";

/* Validation Errors */
"ERROR_WINDOW_TITLE_VALIDATION_FAILED" = "Формат окна заголовка не верный!";
"ERROR_ATTRIBUTE_KEY_VALIDATION_FAILED" = "Ключ аттрибута не уникален!";
"ERROR_AUTOTYPE_SEQUENCE_VALIDATION_FAILED" = "Эта последовательность автоввода неверна!";

/* Errors */
"ERROR_CORRUPT_TREE" = "Повреждена внутренняя структура файла!";
"ERROR_INVALID_FIELD_SIZE" = "Неверный размер поля данных. Пароль неверный?";
"ERROR_INVALID_FIELD_TYPE" = "Неизвестное поле данных. Пароль неверный?";
"ERROR_UNSUPPORTED_DATABASER_VERSION" = "Версия базы данных не поддерживается";
"ERROR_UNSUPPORTED_CHIPHER" = "Не поддерживается алгоритм шифрования";
"ERROR_UNKNOWN_FILE_FORMAT" = "Неизвестный формат файла";
"ERROR_HEADER_CORRUPTED" = "Заголовк поврежден";
"ERROR_UNSUPPORTED_KDBX_COMPRESSION_ALGORITHM" = "Не поддерживается алгоритм сжатия";
"ERROR_UNSUPPORTED_KDBX_RANDOM_STREAM" = "Не поддерживается случайный тип потока";
"ERROR_INTEGRITY_CHECK_FAILED" = "Целостность базы данных не гарантируется";
"ERROR_PASSWORD_OR_KEYFILE_WRONG" = "Пароль и/или файл ключа неверный";
"ERROR_KEEPASSFILE_ELEMENT_MISSING" = "XML файл не содержит KeePassFile элемент";
"ERROR_ROOT_ELEMENT_MISSING" = "XML файл не содержит корневой узел";
"ERROR_GROUP_ELEMENT_MISSING" = "XML файл не содержит узел Group";
"ERROR_HEADER_HASH_MISSMATCH" = "Неверный хэш заголовка. Файл поврежеден.";
"ERROR_XML_KEYFILE_WITHOUT_KEY_ELEMENT" = " XML файл ключа не содержит элемента ключа";
"ERROR_XML_KEYFILE_WITHOUT_DATA_ELEMENT" = "XML файл ключа не содержит элемента данных";
"ERROR_XML_KEYFILE_DATA_PARSING_ERROR" = "Не могу прочитать данные в XML файле ключа";
"ERROR_HEADER_HASH_VERIFICATION_FAILED" = "Хэш заголовка базы данных неверный. Целостность данных может быть нарушена!";
